In [1]:
#experiment no.5 creation of data frame

In [2]:
#Name:Madhura D.Ingole
#Roll no :20
#sec:A
#Sub:ET2
#date:25-08-2025

In [45]:
import pandas as pd

In [46]:
#creating Data frame 
df=pd.DataFrame([[10,12,14,16],[11,18,15,21],[13,20,17,19]],
columns= ['CD','DBMS','DSS','CAO'])

In [47]:
df

   CD  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   21
2  13    20   17   19

In [48]:
df.shape

(3, 4)

In [49]:
df.size

12

In [50]:
df.ndim

2

In [51]:
df2=pd.DataFrame([[11,12,17,19]],
columns=['DBMS','DSS','CAO','CD'])

In [52]:
df3=df.append(df.append(df2,ignore_index=True))

In [53]:
df2

   DBMS  DSS  CAO  CD
0    11   12   17  19

In [54]:
df3

   CD  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   21
2  13    20   17   19
0  10    12   14   16
1  11    18   15   21
2  13    20   17   19
3  19    11   12   17

In [55]:
df2.size

4

In [56]:
df3.size

28

In [57]:
df2.shape

(1, 4)

In [58]:
df3.shape

(7, 4)

# Adding Attribute(columns)name DM

In [59]:
df3['DM']=[13,14,17,18,19,14,16]

In [60]:
df3

   CD  DBMS  DSS  CAO  DM
0  10    12   14   16  13
1  11    18   15   21  14
2  13    20   17   19  17
0  10    12   14   16  18
1  11    18   15   21  19
2  13    20   17   19  14
3  19    11   12   17  16

# Deleting record

In [61]:
df4=df3.drop(index=[1])

In [62]:
df4

   CD  DBMS  DSS  CAO  DM
0  10    12   14   16  13
2  13    20   17   19  17
0  10    12   14   16  18
2  13    20   17   19  14
3  19    11   12   17  16

# deleting attribute from df3

In [63]:
df5=df3.drop(columns=['DM'])

In [64]:
df5

   CD  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   21
2  13    20   17   19
0  10    12   14   16
1  11    18   15   21
2  13    20   17   19
3  19    11   12   17

In [65]:
#finding  mean of DSS
print("Mean of DSS:",df5['DSS'].mean())

Mean of DSS: 14.857142857142858

In [66]:
#finding  median of DSS
print("Median of DSS:",df5['DSS'].median())

Median of DSS: 15.0

In [67]:
#finding  mode of DSS
print("Mode of DSS:",df5['DSS'].mode())

Mode of DSS: 0    14
1    15
2    17
dtype: int64

In [68]:
#finding  min of DSS
print("Min of DSS:",df5['DSS'].min())

Min of DSS: 12

In [69]:
#finding  max of DSS
print("Max of DSS:",df5['DSS'].max())

Max of DSS: 17

In [70]:
Name=['Madhura','janvi','tanvi','gauri','Anvi']
Name

['Madhura', 'janvi', 'tanvi', 'gauri', 'Anvi']

In [72]:
Roll_list=pd.series(Name,index=[1,2,3,4,5])

AttributeError: module 'pandas' has no attribute 'series'